{"sections":{"banner":{"type":"banner-image","settings":{}},"main":{"type":"main-page","disabled":true,"settings":{"page_alignment":"a-left"}},"16269717761ea06eb7":{"type":"accordion","blocks":{"16269717761ea06eb7-0":{"type":"accordion_pane","settings":{"title":"1) How do I track my order","content":"<p>Tracking link will be sent to you via email and SMS along with the order ID, information about the products ordered, as well as the expected delivery time once order has been placed on the website. You can also track your order through <em>Track your Order\/Return<\/em> tab on the website.<\/p>"}},"16269717761ea06eb7-1":{"type":"accordion_pane","settings":{"title":"2) I'm unsure if the order I placed was successful","content":"<p>You can review the status of your order and other tracking related queries through <em>Track your Order\/Return<\/em>. In case your order history doesn’t show your recent order, please recheck after 30 minutes or contact us at +91 9429692121 or <a href=\"mailto:sharewithus@styleunion.in\">sharewithus@styleunion.in<\/a><\/p>"}},"16269717761ea06eb7-2":{"type":"accordion_pane","settings":{"title":"3) How long will it take for my order to reach me?","content":"<p>We aim to dispatch orders placed on our website within 2-3 business days upon confirmation of order to addresses within India only, subject to product availability. You may also refer to the product page of the item purchased for knowing the estimated delivery time. The delivery timelines may vary depending on the delivery location. Please note that for orders with multiple items, your item may arrive in multiple shipments based on the delivery dates. <\/p>"}},"accordion_pane_UnpD3P":{"type":"accordion_pane","settings":{"title":"4) An item is missing from my order","content":"<p>Our shipments go through rigorous check processes before they are dispatched. However, in the rare case of a missing item in your order, please contact our support team immediately at +91 9429692121 or <a href=\"mailto:sharewithus@styleunion.in\">sharewithus@styleunion.in<\/a><\/p><p>Provide us with your order ID details and elaborate your concern about the missing product. Once your request is received, we will resolve your issue within 72 business hours.<\/p>"}},"accordion_pane_38yrGp":{"type":"accordion_pane","settings":{"title":"5) The order I received is damaged","content":"<p>In the rare case that your product is damaged during shipment or transit, you must notify us by email within 48 hours of the product being delivered and immediately initiate a return request on the website. Nexon will not be responsible for any requests post 48 hours of the delivery. Kindly share videographic evidence (a complete video recording of unpacking the order) and an image of the invoice for our reference. We will investigate the damage from our end and provide with resolutions accordingly. Once your request is approved, we will be responsible to pick the item from you and arrange for a refund.<\/p>"}},"accordion_pane_MW8VTC":{"type":"accordion_pane","settings":{"title":"6) Wasn't available to collect my order","content":"<p>If you were not available to collect your order, please reach out to us on +91 9429692121 or <a href=\"mailto:sharewithus@styleunion.in\">sharewithus@styleunion.in<\/a>to reschedule delivery. Please note that only 3 attempts will be made to deliver your order after which your order will be cancelled automatically and the refund shall be made after deducting the applicable delivery charges or any other fees<\/p>"}},"accordion_pane_Vwtgni":{"type":"accordion_pane","settings":{"title":"7) I want to change the size\/colour of an item I ordered","content":"<p>Once order has been placed on the website, no changes can be made. You may cancel your order but it may not be possible if your order has already been packed for dispatch. In such case, you may refer to our return policy.<\/p>"}},"accordion_pane_pzp9rF":{"type":"accordion_pane","settings":{"title":"8) What can I do my order dispatch is delayed","content":"<p>The estimated delivery times are indicative, and, on some occasions, there could be scenarios of delays beyond our reasonable control. We will keep you informed in case of any delays. In case of any query, please reach out to us on +91 9429692121 or <a href=\"mailto:sharewithus@styleunion.in\">sharewithus@styleunion.in<\/a> and we will resolve your issue regarding the delay.<\/p>"}},"accordion_pane_D79VX3":{"type":"accordion_pane","settings":{"title":"9) Can I modify the details regarding my order","content":"<p>You shall not be able to change the email address, shipping address, mobile number or any other details provided at the time of checkout once order has been placed on the website.<\/p>"}},"accordion_pane_6BnFHQ":{"type":"accordion_pane","settings":{"title":"10) I did not receive the invoice for my order","content":"<p>If you haven't received an invoice for any of your order, please reach out to us on +91 9429692121 or <a href=\"mailto:sharewithus@styleunion.in\">sharewithus@styleunion.in<\/a><\/p>"}}},"block_order":["16269717761ea06eb7-0","16269717761ea06eb7-1","16269717761ea06eb7-2","accordion_pane_UnpD3P","accordion_pane_38yrGp","accordion_pane_MW8VTC","accordion_pane_Vwtgni","accordion_pane_pzp9rF","accordion_pane_D79VX3","accordion_pane_6BnFHQ"],"settings":{"title":"Order Related","max_width":100,"allow_multiple":false}},"1626971780f8294dca":{"type":"accordion","blocks":{"1626971780f8294dca-0":{"type":"accordion_pane","settings":{"title":"1) How do I cancel or return my order","content":"<p>To cancel an order, please contact our support team as soon as possible. Please provide your order number and relevant details to expedite the cancellation process. We will do our best to accommodate your request, but orders that have been already packed for dispatch cannot be cancelled. In this case, you may refer to our Return Policy. In case you want to return any item, you shall initiate a request on the <em>Track your Order\/Return <\/em>Tab subject to the Terms & Conditions under Return Policy.<\/p>"}},"1626971780f8294dca-1":{"type":"accordion_pane","settings":{"title":"2) How long does it take to receive a refund for a cancelled order or returned product","content":"<p>In case your return request is approved or your order is eligible for cancellation, the liable amount will be processed to the original method of payment within 5-7 business days, subject to the Terms & Conditions mentioned in the respective policy. Please note that it may take additional time for the refund to reflect in your account, depending on your bank or payment provider.<\/p><p>In case of any delays, please reach out to us on +91 9429692121 or email us at <a href=\"mailto:sharewithus@styleunion.in\">sharewithus@styleunion.in<\/a>  <\/p>"}},"1626971780f8294dca-2":{"type":"accordion_pane","settings":{"title":"3) Will shipping charges get refunded if I cancel or return my order","content":"<p>Please note that the delivery charges or any other charges\/fees paid are non- refundable.<\/p>"}},"accordion_pane_r7tgjw":{"type":"accordion_pane","settings":{"title":"4) My request for cancallation\/return has not processed or has got declined","content":"<p>Please reach out to us on +91 9429692121 or email us at <a href=\"mailto:sharewithus@styleunion.in\">sharewithus@styleunion.in<\/a>   <\/p>"}},"accordion_pane_jDXWLc":{"type":"accordion_pane","settings":{"title":"5) The farment does not fit me, what can I do","content":"<p>If the product does not fit and you would like a new size, please initiate a return request on the website within 15 business days of receiving the product. <\/p>"}},"accordion_pane_mewLB9":{"type":"accordion_pane","settings":{"title":"6) How are returns processed","content":"<p>Once you initiate a return request under Track your order\/return section, a pick up is scheduled for the item. Our courier partner will come to pick up the item within 3-5 business days after your return request has been approved subject to the Terms & Conditions under Return Policy. Please note that the product should be unused along with tags and invoice intact. During pick up, our delivery agent may do a quality check on the return item. If the item passes the quality check, it is picked up by our courier partner and refund is initiated after deducting the applicable charges and fees. It can take 5- 7 business days to reflect into your bank account as per the bank timelines. You can track your return status from Track your order\/return section.<\/p>"}},"accordion_pane_TQz3dr":{"type":"accordion_pane","settings":{"title":"7) Why wasn't my order picked up","content":"<p>Once you have initiated a return request, our field executives will pick-up the order within 3-5 business days. They will make 3 attempts to pick up the order, post which the pickup automatically gets cancelled. If our courier partner faces any issue in picking up the order, we will keep you informed.<\/p>"}},"accordion_pane_H9zNkm":{"type":"accordion_pane","settings":{"title":"8) Until when an I return my order","content":"<p>Subject to the Terms & Conditions under the Return policy, you can return any item of the order or the entire order within 15 business days of receiving the product. Please note that separate pickup may be scheduled for each item in case return request is initiated for multiple items.<\/p>"}}},"block_order":["1626971780f8294dca-0","1626971780f8294dca-1","1626971780f8294dca-2","accordion_pane_r7tgjw","accordion_pane_jDXWLc","accordion_pane_mewLB9","accordion_pane_TQz3dr","accordion_pane_H9zNkm"],"settings":{"title":"Cancellation & Return","max_width":80,"allow_multiple":false}},"16269718683f95cb9e":{"type":"accordion","blocks":{"16269718683f95cb9e-0":{"type":"accordion_pane","settings":{"title":"1) I want to deactivate my account","content":"<p>To deactivate your account, please contact us via email at <a href=\"mailto:sharewithus@styleunion.in\">sharewithus@styleunion.in<\/a> Our team will respond with a confirmation within 24 to 48 business hours.<\/p>"}},"16269718683f95cb9e-1":{"type":"accordion_pane","settings":{"title":"2) How do I add items to my wishlist","content":"<p>To add an item to your wishlist, click on the heart icon next to the cart button. Once you have added items to the wishlist, you can check them by clicking the wishlist icon next to your profile on the top right of the website. <\/p>"}},"16269718683f95cb9e-2":{"type":"accordion_pane","settings":{"title":"3) I am unable to add products to the wishlist","content":"<p>To add an item to your wishlist, click on the heart icon on the top right corner of the product image. If you encounter any issues while trying to add a product to your wishlist, please feel free to get in touch with us via email at <a href=\"mailto:sharewithus@styleunion.in\">sharewithus@styleunion.in<\/a><\/p>"}}},"block_order":["16269718683f95cb9e-0","16269718683f95cb9e-1","16269718683f95cb9e-2"],"settings":{"title":"Account Related","max_width":80,"allow_multiple":false}},"16269718764d64ee8b":{"type":"accordion","blocks":{"accordion_pane_XYr9n9":{"type":"accordion_pane","settings":{"title":"1) Shipping Charges","content":"<p>A standard shipping charge of Rs. 99 is applicable on all orders which do not qualify for free shipping. Enjoy complimentary shipping for orders above Rs. 1699\/-<\/p>"}},"16269718764d64ee8b-0":{"type":"accordion_pane","settings":{"title":"2) Payment got debited but my order is not yet confirmed","content":"<p>If your most recent order does not show up after successful payment, please refresh the page after some time. If you are still facing the same issue, please reach out to us on +91 9429692121 or email us at <a href=\"mailto:sharewithus@styleunion.in\">sharewithus@styleunion.in<\/a> <\/p>"}},"16269718764d64ee8b-1":{"type":"accordion_pane","settings":{"title":"3) Duplicate Payment","content":"<p>If you have processed the transaction twice for the same order, please send in the proof of both transactions to +91 9429692121 or email us at <a href=\"mailto:sharewithus@styleunion.in\">sharewithus@styleunion.in<\/a> and our support team will coordinate with the accounts team to resolve this for you. Please note that for 3rd party payment issues, you will have to take it up with the service provider or the vendor through whom you have made the payment\/purchase.<\/p>"}},"16269718764d64ee8b-2":{"type":"accordion_pane","settings":{"title":"4) Is there an EMI option","content":"<p>No, we currently do not provide EMI based payment services.<\/p>"}},"accordion_pane_3FgbqE":{"type":"accordion_pane","settings":{"title":"5) Facing payment issues","content":"<p>For any payment related concerns, reach out to us on +91 9429692121 or email us at <a href=\"mailto:sharewithus@styleunion.in\">sharewithus@styleunion.in<\/a> mentioning the payment details, issue you are facing and any additional relevant information which could help us resolve the issue. <\/p>"}},"accordion_pane_ErzpHJ":{"type":"accordion_pane","settings":{"title":"6) The refund amount processed is not correct","content":"<p>If you have received an incorrect refund amount, reach out to us on +91 9429692121 or email us at <a href=\"mailto:sharewithus@styleunion.in\">sharewithus@styleunion.in<\/a> <\/p>"}}},"block_order":["accordion_pane_XYr9n9","16269718764d64ee8b-0","16269718764d64ee8b-1","16269718764d64ee8b-2","accordion_pane_3FgbqE","accordion_pane_ErzpHJ"],"settings":{"title":"Payment Related","max_width":80,"allow_multiple":false}},"1626972241b04c253a":{"type":"image-with-text-overlay","disabled":true,"settings":{"scale":2,"page_height":300,"caption_position":"middle_center","caption_below":false,"heading":"Still need help? Send us a note.","subheading":"","button_text":"Contact Us","button_link":"shopify:\/\/pages\/contact","heading_font_size":31,"subheading_font_size":16,"text_color":"#000000","button_text_color":"#ffffff","button_color":"#000000","background":"rgba(0,0,0,0)","overlay_color":"#000000","overlay_opacity":0,"section_padding":"top"}}},"order":["banner","main","16269717761ea06eb7","1626971780f8294dca","16269718683f95cb9e","16269718764d64ee8b","1626972241b04c253a"]}